package Utils;

public class Verbs {

    String [] arrayVerbsI = {"пишу", "писал", "напишу", "нашел", "находил", "найду",
            "думаю", "думал", "подумаю", "следую", "следомал", "проследую", "смотрю",
            "смотрел", "посмотрю", "играю", "играл", "поиграю", "вернулся", "возвратился",
            "возвращусь", "создал", "создавал", "создам", "решил", "решаю", "решу", "выхожу",
            "выходил", "выйду", "лежу", "лежал", "полежу", "читаю", "читал", "почитаю",
            "рассказывал", "расскажу", "пройду", "прохожу", "прошел", "стою", "рассказываю",
            "стоял", "постою", "слышу", "слышал", "услышу", "ухожу", "уходил", "схожу",
            "составляю", "стоставлял", "стоставлю", "найду", "нашел", "находил", "чувствовал",
            "чувствую", "почувствую", "предлагаю", "предлагал", "предлажу", "вызывал", "вызываю",
            "вызову", "вхожу", "входил", "войду", "собираюсь", "собирался", "собирусь" };

    String [] arrayVerbsYou = {"пишешшь", "писал", "напишешь", "нашел", "находил", "найдешь",
            "думаешь", "думал", "подумал", "следуешь", "следовал", "проследуешь", "смотришь",
            "смотрел", "посмотришь", "играешь", "играл", "поиграешь", "вернулся", "возвратился",
            "возвратишься", "создал", "создавал", "создашь", "решил", "решаешь", "решишь", "выходишь",
            "выходил", "выйдешь", "лежишь", "лежал", "полежишь", "читаешь", "читал", "почитаешь",
            "рассказывал", "расскажешь", "пройдешь", "проходишь", "пройдешь", "стоишь", "расскажешь",
            "стоял", "постоишь", "слышишь", "слышал", "услышишь", "уходишь", "уходил", "сходишь",
            "составишь", "составляешь", "стоставлял", "найдешь", "нашел", "находил", "чувствовал",
            "чувствуешь", "почувствуешь", "предлагаешь", "предлагал", "предложишь", "вызывал", "вызываешь",
            "вызовешь", "входишь", "входил", "войдешь", "собираешься", "собирался", "собирешься"};

    String [] arrayVerbsWe = {"пишем", "писали", "напишем", "нашли", "находили", "найдем",
            "думаем", "думали", "подумали", "следуем", "следовали", "проследуем", "смотрим",
            "смотрели", "посмотрим", "играем", "играли", "поиграем", "вернулись", "возвратились",
            "возвратимся", "создали", "создавали", "создадим", "решили", "решаем", "решим", "выходим",
            "выходили", "выйдем", "лежим", "лежали", "полежим", "читаем", "читали", "почитаем",
            "рассказывали", "расскажем", "пройдем", "проходим", "пройдем", "стоим", "расскажем",
            "стояли", "постоим", "слышим", "слышали", "услышим", "уходим", "уходили", "сходим",
            "составим", "составляем", "стоставляли", "найдем", "нашли", "находили", "чувствовали",
            "чувствуем", "почувствуем", "предлагаем", "предлагали", "предложим", "вызывали", "вызываем",
            "вызовем", "входим", "входили", "войдем", "собираемся", "собирались", "собиремся"};
    String [] arrayVerbsThey = {"пишут", "писали", "напишут", "нашли", "находили", "найдут",
            "думают", "думали", "подумали", "следуют", "следовали", "проследуют", "смотрят",
            "смотрели", "посмотрят", "играют", "играли", "поиграют", "вернулись", "возвратились",
            "возвратятся", "создали", "создавали", "создадут", "решили", "решают", "решат", "выходят",
            "выходили", "выйдут", "лежат", "лежали", "полежат", "читают", "читали", "почитают",
            "рассказывали", "расскажут", "пройдут", "проходят", "пройдут", "стоят", "расскажут",
            "стояли", "постоят", "слышат", "слышали", "услышат", "уходят", "уходили", "сходят",
            "составят", "составляют", "стоставляли", "найдут", "нашли", "находили", "чувствовали",
            "чувствуют", "почувствуют", "предлагают", "предлагали", "предложат", "вызывали", "вызывают",
            "вызовут", "входят", "входили", "войдут", "собираются", "собирались", "собирутся"};

    String [] arrayVerbsHe = {"пишет", "писал", "напишет", "нашел", "находил", "найдет",
            "думает", "думал", "подумает", "следует", "следовал", "проследует", "смотрит",
            "смотрел", "посмотрит", "играет", "играл", "поиграет", "вернулся", "возвратился",
            "возвратился", "создал", "создавал", "создаст", "решил", "решает", "решит", "выходит",
            "выходил", "выйдет", "лежит", "лежал", "полежит", "читает", "читал", "почитает",
            "рассказывал", "расскажет", "пройдет", "проходит", "пройдет", "стоит", "расскажет",
            "стоял", "постоит", "слышит", "слышал", "услышит", "уходит", "уходил", "сходит",
            "составит", "составляет", "стоставлял", "найдет", "нашел", "находил", "чувствовал",
            "чувствует", "почувствует", "предлагает", "предлагал", "предложит", "вызывал", "вызывает",
            "вызовет", "входит", "входил", "войдет", "собирается", "собирался", "собирется"};

    String [] arrayVerbsShe = {"пишет", "писала", "напишет", "нашла", "находила", "найдет",
            "думает", "думала", "подумает", "следует", "следовала", "проследует", "смотрит",
            "смотрела", "посмотрит", "играет", "играла", "поиграет", "возвращается", "возвратилась",
            "вернется", "создала", "создавала", "создаст", "решила", "решает", "решит", "выходит",
            "выходила", "выйдет", "лежит", "лежала", "полежит", "читает", "читала", "почитает",
            "рассказывала", "расскажет", "пройдет", "проходит", "проходила", "стоит", "расскажет",
            "стояла", "постоит", "слышит", "слышала", "услышит", "уходит", "уходила", "сходит",
            "составит", "составляет", "стоставляла", "найдет", "нашла", "находила", "чувствовала",
            "чувствует", "почувствует", "предлагает", "предлагала", "предложит", "вызывала", "вызывает",
            "вызовет", "входит", "входила", "войдет", "собирается", "собиралась", "собирется"};

    public String[] getArrayVerbsI() {
        return arrayVerbsI;
    }

    public String[] getArrayVerbsYou() {
        return arrayVerbsYou;
    }

    public String[] getArrayVerbsWe() {
        return arrayVerbsWe;
    }

    public String[] getArrayVerbsThey() {
        return arrayVerbsThey;
    }

    public String[] getArrayVerbsHe() {
        return arrayVerbsHe;
    }

    public String[] getArrayVerbsShe() {
        return arrayVerbsShe;
    }

    public String takeOneVerb(String arr [] ,int index){
        return arr[index];
    }
}
